nc: 1  
scales:
  n: [0.33, 0.25, 1024]


backbone:
  # Initial downsampling
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, WDSE, [16]]            # 1

  # Stage 1
  - [-1, 1, Conv, [128, 3, 2]]       # 2-P2/4
  - [-1, 3, C2f, [128, True]]        # 3
  - [-1, 1, DNR, [32]]              # 4-P3

  # Stage 2
  - [-1, 1, Conv, [256, 3, 2]]       # 5-P3/8
  - [-1, 6, C2f, [256, True]]        # 6
  - [-1, 1, DNR, [64]]             # 7-P4

  # Stage 3
  - [-1, 1, Conv, [512, 3, 2]]       # 8-P4/16
  - [-1, 6, C2f, [512, True]]        # 9
  - [-1, 1, DNR, [128]]             # 10-P5

  # Stage 4
  - [-1, 1, Conv, [1024, 3, 2]]      # 11-P5/32
  - [-1, 3, C2f, [1024, True]]       # 12
  - [-1, 1, SPPF, [1024, 5]]         # 13

# Head with GSA at critical fusion points
head:
  # P4 upsampling
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 10], 1, Concat, [1]]                  # 15
  - [-1, 3, C2f, [512]]                         # 16

  # Strategic GSA placement
  - [-1, 1, GCS, [512, 8]]                     # 17

  # P3 upsampling
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 7], 1, Concat, [1]]                   # 19
  - [-1, 3, C2f, [256]]                         # 20

  # Downsample paths
  - [-1, 1, Conv, [256, 3, 2]]                  # 21
  - [[-1, 17], 1, Concat, [1]]                  # 22
  - [-1, 3, C2f, [512]]                         # 23

  - [-1, 1, Conv, [512, 3, 2]]                  # 24
  - [[-1, 13], 1, Concat, [1]]                  # 25
  - [-1, 3, C2f, [1024]]                        # 26

  # Detect heads
  - [[20, 23, 26], 1, Detect, [nc]]             # 27

